package bulls.feed.current.enums;

public enum FeedInfoType {
    /**
     * +---------------------+----------+
     * | 정보구분            | 정보코드 |
     * +---------------------+----------+
     * | 시장공통            | 00       |
     * +---------------------+----------+
     * | 주식                | 01       |
     * +---------------------+----------+
     * | kospi200선물        | 01       |
     * +---------------------+----------+
     * | 코스닥150선물       | 02       |
     * +---------------------+----------+
     * | kospi200옵션        | 03       |
     * +---------------------+----------+
     * | cme-kospi200선물    | 04       |
     * +---------------------+----------+
     * | "eurex-kospi200옵션 |          |
     * +---------------------+----------+
     * | 선물"               | 05       |
     * +---------------------+----------+
     * | 주식선물            | 01       |
     * +---------------------+----------+
     * | 주식옵션            | 02       |
     * +---------------------+----------+
     * | 상품선물            | 01       |
     * +---------------------+----------+
     * | 상품옵션            | 02       |
     * +---------------------+----------+
     * | 장내국채            | 01       |
     * +---------------------+----------+
     * | 장내소매채권        | 02       |
     * +---------------------+----------+
     * | 장내소액채권        | 03       |
     * +---------------------+----------+
     * | 장내주식관련사채    | 04       |
     * +---------------------+----------+
     * | 장내rp(repo)        | 05       |
     * +---------------------+----------+
     * | 장내일반채권        | 06       |
     * +---------------------+----------+
     * | 장외채권(호가집중)  | 07       |
     * +---------------------+----------+
     * | 기타                | 90       |
     * +---------------------+----------+
     */
    Common("00"),
    Equity("01"),
    Kospi200Fut("01"),
    Kosdaq150Fut("02"),
    Kospi200Opt("03"),
    CME("04"),
    EUREX("05"),
    StockFut("01"),
    StockOpt("02"),
    CmdtyFut("01"),
    CmdtyOpt("02"),
    장내국채("01"),
    장내소매채권("02"),
    장내소액채권("03"),
    장내주식관련채권("04"),
    장내RP("05"),
    장내일반채권("06"),
    장외채권("07"),
    SectorFut("10"),
    Kospi200MiniFut("12"),
    Kospi200MiniOpt("13"),
    Krx300Fut("16"),
    Kosdaq150Opt("17");
    final String code;

    FeedInfoType(String code) {
        this.code = code;
    }

    public boolean isSameType(String code) {
        return this.code.equals(code);
    }

    public boolean isSameTypeByTrCode(String trCode) {
        return this.code.equals(trCode.substring(2, 4));
    }
}
