package bulls.feed.dc.enums;

import java.util.HashMap;

public enum 거래정지사유코드 {
    풍문등관련주가및거래량급변(101),
    불성실공시법인지정(104),
    합병분할영업의양수도(111),
    주식배당10이상(115),
    감사의견부적정(123),
    자본전액잠식(125),
    공시의무위반(127),
    반기검토의견부적정(135),
    반기검토의견의견거절(136),
    관리종목지정(146),
    풍문등관련주가및거래량급변발행ELW포함(154),
    자본잠식(163),
    업무의정지(166),
    단기과열지정(186),
    투자경고및위험주식(211),
    투자경고및위험투자위험종목지정후주가상승변경(301),
    풍문또는보도관련(601),
    코스닥불성실공시법인지정(610),
    관리종목지정사유발생(613),
    상장폐지사유발생(614),
    투자자보호(616),
    합병(652),
    분할(653),
    영업양수도(654),
    무상증자(655),
    자본감소(656),
    이익소각(657),
    주식배당(658),
    주식교환이전(659),
    단일판매공급계약(674),
    기타(0);

    public int getValue() {
        return this.value;
    }

    public static 거래정지사유코드 getEnum(int value) {
        return 거래정지사유코드map.get(value);
    }

    int value;

    거래정지사유코드(int value) {
        this.value = value;
    }

    static HashMap<Integer, 거래정지사유코드> 거래정지사유코드map;

    static {
        for (거래정지사유코드 code : 거래정지사유코드.values()) {
            거래정지사유코드map.put(code.getValue(), code);
        }
    }
}
