package bulls.order.enums;

import java.util.Arrays;
import java.util.Dictionary;
import java.util.Hashtable;

public enum 장구분 {
    /**
     * +-----------+-----------------+------------------------------------------+---------+--+
     * |           |                 |                   AS-IS                  |  TO-BE  |  |
     * |    구분   |  기존 호가 구분 +--------------+---------------------------+---------+--+
     * |           |                 | 대량매매구분 |     정규시간외구분코드    | 보드 ID |  |
     * +-----------+-----------------+--------------+----+----------------------+---------+--+
     * |     　    |        　       | 　           | 　 |          　          |    AL   |  |
     * +-----------+-----------------+--------------+----+----------------------+---------+--+
     * |           |                 |              |  1 | 정규장               |    G1   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  2 | 장개시전시간외종가   |    G2   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  3 | 장종료후시간외종가   |    G3   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           | 1) 일반호가     |       -      |  4 | 장종료후시간외단일가 |    G4   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  2 | 장개시전시간외종가   |    G5   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  7 | 일반Buy-In           |    G7   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  8 | 당일Buy-In           |    G8   |  |
     * |           +-----------------+--------------+----+----------------------+---------+--+
     * |           |                 |              |  1 | 정규장               |    I1   |  |
     * |           | 2) 경쟁대량     |       -      +----+----------------------+---------+--+
     * |           |                 |              |  2 | 장개시전시간외       |    I2   |  |
     * |   현물/   +-----------------+--------------+----+----------------------+---------+--+
     * |      파생 |                 |              |  1 | 정규장               |    B1   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 | 1. 대량      |  2 | 장개시전시간외       |    B2   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 |              |  3 | 장종료후시간외       |    B3   |  |
     * |           |                 +--------------+----+----------------------+---------+--+
     * |           |                 |              |  1 | 정규장               |    K1   |  |
     * |           |                 |              +----+----------------------+---------+--+
     * |           |                 | 2. 바스켓    |  2 | 장개시전시간외       |    K2   |  |
     * |           | 3) 대량 및 협의 |              +----+----------------------+---------+--+
     * |           |                 |              |  3 | 장종료후시간외       |    K3   |  |
     * |           |                 +--------------+----+----------------------+---------+--+
     * |           |                 | 3. 협의대량  |  1 | 정규장               |    N1   |  |
     * |           |                 +--------------+----+----------------------+---------+--+
     * |           |                 | 4. EFP       |  1 | 정규장               |    E1   |  |
     * |           |                 +--------------+----+----------------------+---------+--+
     * |           |                 | 5. FLEX      |  1 | 정규장               |    F1   |  |
     * |           |                 +--------------+----+----------------------+---------+--+
     * |           |                 | 6. 협의거래  |  2 | 장개시전시간외       |    U2   |  |
     * +-----------+-----------------+--------------+----+----------------------+---------+--+
     */
    정규장("G1"),
    장개시전시간외종가("G2"),
    장종료후시간외종가("G3"),
    장종료후시간외단일가("G4"),
    //    일반BuyIn("G7"),
//    당일BuyIn("G8"),
    NA("");

    String stringValue;
    byte[] byteValue;

    장구분(String str) {
        this.stringValue = str;
        this.byteValue = str.getBytes();
    }

    public String getStringValue() {
        return stringValue;
    }

    public byte[] getByteValue() {
        return byteValue;
    }

    static Dictionary<String, 장구분> dic;

    static {
        dic = new Hashtable<>();
        for (장구분 value : 장구분.values()) {
            dic.put(value.getStringValue(), value);
        }
    }

    public static 장구분 getEnumInstance(String str) {
        var t = dic.get(str);
        if (t == null)
            return NA;
        return t;
    }

    public static 장구분 getEnumInstance(byte[] arr) {
        for (장구분 value : 장구분.values()) {
            if (Arrays.equals(arr, value.getByteValue()))
                return value;
        }
        return NA;
    }
}
